# file location: ${HOME}/dots/Brewfile
# Usage: brew bundle install --file=~/dots/Brewfile
#
# Aliases:
#   alias bbd='brew bundle dump --force --file=~/dots/Brewfile'
#   alias bbi='brew bundle install --file=~/dots/Brewfile'
#   alias bbc='brew bundle check --file=~/dots/Brewfile'
#   alias bbclean='brew bundle cleanup --file=~/dots/Brewfile'

# Install all casks to /Applications and adopt any existing app already present
cask_args appdir: "~/Applications", fontdir: "/Library/Fonts", adopt: true

# ---- Taps ----
tap "hashicorp/tap"
tap "itsfrank/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "lizardbyte/homebrew"
tap "microsoft/git"
tap "nikitabobko/tap"

# ---- Formulae ----
brew "black"
brew "btop"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "git-extras"
brew "git-lfs"
brew "imagemagick"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "openjdk"
brew "php"
brew "prettier"
brew "ripgrep"
brew "ruby"
brew "ruff"
brew "sapling"
brew "stow"
brew "temporal"
brew "tlrc"
brew "topgrade"
brew "tree"
brew "uv"
brew "watchman"
brew "wget"
brew "zoxide"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/vault"
brew "itsfrank/tap/portpal"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# ---- Casks ----

# Window management & desktop
cask "nikitabobko/tap/aerospace"
cask "alt-tab"
cask "jordanbaird-ice"
cask "middleclick"

# Menu bar & display
cask "alcove"
cask "aldente"
cask "monitorcontrol"
cask "lookaway"

# Input & peripherals
cask "karabiner-elements"
cask "keyboardcleantool"
cask "linearmouse"
cask "logitech-g-hub"

# Security & auth
cask "1password"
cask "bitwarden"

# Development
cask "docker-desktop"
cask "kitty"
cask "postman"
cask "rider"
cask "visual-studio-code"
cask "git-credential-manager"

# Productivity
cask "alfred"
cask "appcleaner"
cask "asana"
cask "obsidian"
cask "prefs-editor"
cask "prismlauncher"
cask "wispr-flow"

# Communication & social
cask "discord"
cask "slack"
cask "wechat"
cask "neteasemusic"
cask "zoom"

# Media & entertainment
cask "iina"
cask "spotify"
cask "steam"
cask "roblox"
cask "robloxstudio"
cask "crossover"
cask "epic-games"

# Browsers
cask "firefox"
cask "google-chrome"

# Hardware & devices
cask "qflipper"
cask "opal-composer"
cask "dcv-viewer"

# Other
cask "miniconda"
cask "updatest"
cask "font-jetbrains-mono-nerd-font"
cask "itsfrank/tap/portpal-app"

# No cask available (installed manually):
#   Amphetamine       - App Store
#   Coder Desktop     - no cask
#   Falcon            - corp managed (CrowdStrike)
#   GlobalProtect     - no cask
#   Googly Eyes       - no cask
#   Jamf Self Service - corp managed
#   Karabiner-EventViewer - companion to karabiner-elements
#   Klack             - no cask
#   Postman Agent     - companion to Postman
#   Roscan            - no cask
#   Santa             - corp managed (Google)

# ---- VS Code Extensions ----
vscode "coder.coder-remote"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"

# ---- Go tools ----
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
